{
  "21": {
    "name": "FTP",
    "description": "بروتوكول نقل الملفات، يستخدم لنقل البيانات بين الأنظمة. لا يوفر تشفيرًا في الاتصال.",
    "risk": "يمكن أن يُستغل لاستهداف بيانات حساسة أو تنفيذ هجمات القوة العمياء على كلمات المرور.",
    "protection": "استخدم SFTP (بروتوكول نقل الملفات الآمن) بدلاً من FTP، وفرض المصادقة القوية.",
    "danger_level": "عالي"
  },
  "22": {
    "name": "SSH",
    "description": "بروتوكول الاتصال الآمن بين الأنظمة، يُستخدم للوصول إلى الخوادم بشكل آمن.",
    "risk": "قد يُستغل بهجمات القوة العمياء للوصول غير المصرح به.",
    "protection": "استخدم المفاتيح الخاصة للمصادقة بدلاً من كلمات المرور، وقم بتقييد الوصول إلى عناوين IP محددة.",
    "danger_level": "مرتفع"
  },
  "23": {
    "name": "Telnet",
    "description": "بروتوكول قديم لا يوفر تشفيرًا للبيانات، مما يجعله عرضة لهجمات التنصت.",
    "risk": "التنصت على البيانات قد يؤدي إلى تسريب كلمات المرور والمعلومات الحساسة.",
    "protection": "قم بتعطيل Telnet واستبدله بـ SSH.",
    "danger_level": "عالي"
  },
  "80": {
    "name": "HTTP",
    "description": "بروتوكول الويب العادي الذي لا يوفر تشفيرًا.",
    "risk": "قد تحتوي التطبيقات المتاحة عبر HTTP على ثغرات يمكن استغلالها.",
    "protection": "استخدم HTTPS (بروتوكول نقل النص الآمن) بدلاً من HTTP.",
    "danger_level": "متوسط"
  },
  "443": {
    "name": "HTTPS",
    "description": "بروتوكول الويب الآمن الذي يوفر تشفيرًا للبيانات.",
    "risk": "إذا كانت الشهادات غير صحيحة أو لا يتم تحديثها بشكل منتظم، قد يتم استغلالها.",
    "protection": "تأكد من أن الشهادات محدثة وصحيحة، واستخدم HTTP Strict Transport Security (HSTS).",
    "danger_level": "منخفض"
  },
  "3306": {
    "name": "MySQL",
    "description": "قاعدة بيانات مفتوحة عبر الإنترنت تستخدم هذا المنفذ، وعادةً ما تكون معرضة للهجمات.",
    "risk": "قد يتم استغلال المنفذ للوصول إلى قاعدة البيانات إذا لم يكن محميًا بشكل صحيح.",
    "protection": "قصر الوصول على IPs موثوقة فقط، واستخدام كلمات مرور قوية على قاعدة البيانات.",
    "danger_level": "عالي"
  },
  "3389": {
    "name": "RDP",
    "description": "بروتوكول سطح المكتب البعيد (Remote Desktop Protocol) يُستخدم للوصول إلى الأنظمة عن بُعد.",
    "risk": "منفذ RDP مستهدف بشكل شائع في هجمات القوة العمياء لسرقة بيانات الدخول.",
    "protection": "قم بتغيير المنفذ الافتراضي، واستخدم VPN للوصول إلى RDP بدلاً من الفتح المباشر.",
    "danger_level": "عالي"
  },
  "25": {
    "name": "SMTP",
    "description": "بروتوكول إرسال البريد الإلكتروني.",
    "risk": "يمكن استغلاله في إرسال البريد العشوائي أو الهجمات من خلال تقنيات مثل انتحال الهوية.",
    "protection": "استخدم بروتوكولات أمان مثل STARTTLS و SPF لمنع استخدامه في إرسال البريد العشوائي.",
    "danger_level": "مرتفع"
  },
  "110": {
    "name": "POP3",
    "description": "بروتوكول البريد الوارد.",
    "risk": "إذا كان البريد لا يستخدم تشفيرًا، فإنه يكون عرضة للتنصت.",
    "protection": "استخدم IMAPS أو POP3S بدلاً من POP3 العادي.",
    "danger_level": "عالي"
  },
  "143": {
    "name": "IMAP",
    "description": "بروتوكول الوصول إلى البريد الإلكتروني عبر الإنترنت.",
    "risk": "يمكن أن يكون عرضة لهجمات التنصت إذا لم يستخدم تشفيرًا.",
    "protection": "استخدم IMAPS بدلاً من IMAP العادي لضمان الأمان.",
    "danger_level": "مرتفع"
  },
  "53": {
    "name": "DNS",
    "description": "بروتوكول نظام أسماء النطاقات الذي يستخدم في ترجمة الأسماء إلى عناوين IP.",
    "risk": "يمكن أن يُستغل في هجمات DDoS أو التلاعب في استعلامات DNS.",
    "protection": "استخدم DNSSEC لضمان أمان الاستعلامات.",
    "danger_level": "متوسط"
  },
  "69": {
    "name": "TFTP",
    "description": "بروتوكول نقل الملفات البسيط.",
    "risk": "يفتقر إلى التشفير والأمان، مما يجعله عرضة للاستغلال.",
    "protection": "قم بتعطيله واستخدام بروتوكولات أخرى مثل SFTP.",
    "danger_level": "عالي"
  },
  "5060": {
    "name": "SIP",
    "description": "بروتوكول بدء الجلسة المستخدم في تطبيقات الصوت والفيديو.",
    "risk": "يُستهدف بشكل شائع في هجمات مثل هجمات DoS أو انتحال الهوية.",
    "protection": "استخدم تشفير SSL/TLS وتأمين الوصول.",
    "danger_level": "مرتفع"
  },
  "5000": {
    "name": "UPnP",
    "description": "بروتوكول تسهيل الاتصال الشبكي بين الأجهزة.",
    "risk": "قد يؤدي فتحه إلى ثغرات كبيرة يمكن أن تُستغل من قبل المهاجمين.",
    "protection": "قم بتعطيل UPnP أو تأمين الوصول باستخدام جدار ناري.",
    "danger_level": "عالي"
  },
  "5900": {
    "name": "VNC",
    "description": "بروتوكول التحكم عن بعد عبر الشبكة.",
    "risk": "منفذ VNC معرض للاستخدام في هجمات القوة العمياء.",
    "protection": "استخدم كلمة مرور قوية، ويفضل استخدام VPN لتأمين الاتصال.",
    "danger_level": "عالي"
  },
  "1521": {
    "name": "Oracle DB",
    "description": "قاعدة بيانات Oracle التي تستخدم هذا المنفذ.",
    "risk": "قد يتم استغلال المنفذ للوصول غير المصرح به إلى قاعدة البيانات.",
    "protection": "استخدم جدار ناري لحظر الوصول إلى المنفذ من أي مصادر غير موثوقة.",
    "danger_level": "عالي"
  },
  "8080": {
    "name": "HTTP Alternate",
    "description": "منفذ HTTP بديل عادة ما يُستخدم للتطبيقات التي تتطلب الوصول إلى الشبكة.",
    "risk": "قد يحتوي على ثغرات أو يستخدم في تطبيقات غير محمية.",
    "protection": "استخدم HTTPS بدلاً من HTTP في هذا المنفذ.",
    "danger_level": "متوسط"
  },
  "11211": {
    "name": "Memcached",
    "description": "خدمة تخزين البيانات المؤقتة التي تستخدم هذا المنفذ.",
    "risk": "قد يتعرض لهجمات DDoS أو ثغرات أمنية أخرى.",
    "protection": "استخدم جدار ناري لحظر الوصول من الإنترنت أو تأمينه بشكل صحيح.",
    "danger_level": "مرتفع"
  },
  "2049": {
    "name": "NFS",
    "description": "نظام الملفات الشبكي يستخدم لتبادل الملفات بين الأجهزة.",
    "risk": "إذا لم يكن محميًا، يمكن استغلاله للوصول إلى البيانات الحساسة.",
    "protection": "استخدم جدار ناري لتقييد الوصول فقط للأجهزة الموثوقة.",
    "danger_level": "مرتفع"
  },
  "2045": {
    "name": "ISAKMP",
    "description": "بروتوكول تبادل المفاتيح بين الأجهزة في الشبكات.",
    "risk": "قد يتعرض للهجمات مثل هجمات DoS أو سرقة المفاتيح.",
    "protection": "استخدم تشفير SSL/TLS لتأمين الاتصال.",
    "danger_level": "عالي"
  },
  "123": {
    "name": "NTP",
    "description": "بروتوكول الوقت الشبكي.",
    "risk": "يمكن استغلاله في هجمات DDoS أو تغيير الوقت على الأنظمة.",
    "protection": "استخدم مصادقة NTP لمنع الهجمات.",
    "danger_level": "متوسط"
  },
  "1433": {
    "name": "MSSQL",
    "description": "قاعدة بيانات Microsoft SQL Server.",
    "risk": "قد يتم استغلال المنفذ إذا لم يكن محميًا بشكل صحيح.",
    "protection": "استخدم جدار ناري وفرض المصادقة على المنفذ.",
    "danger_level": "عالي"
  },
  "5432": {
    "name": "PostgreSQL",
    "description": "قاعدة بيانات PostgreSQL.",
    "risk": "يمكن استغلاله للوصول غير المصرح به إلى قاعدة البيانات.",
    "protection": "استخدم كلمات مرور قوية والمصادقة الآمنة.",
    "danger_level": "عالي"
  },
  "6660": {
    "name": "IRC",
    "description": "بروتوكول الدردشة IRC.",
    "risk": "عرضة لهجمات التسلل أو هجمات التجسس.",
    "protection": "استخدم تشفير الاتصال وفرض المصادقة القوية.",
    "danger_level": "مرتفع"
  },
  "9898": {
    "name": "Weave",
    "description": "نظام إدارة الشبكة من خلال تطبيقات الحاويات.",
    "risk": "قد يؤدي إلى تسريب البيانات إذا لم يتم تأمينه بشكل صحيح.",
    "protection": "استخدم مصادقة قوية وتشفير للبيانات.",
    "danger_level": "مرتفع"
  }
}
